cask_args appdir: "/Applications", require_sha: true
tap "homebrew/bundle"
tap "homebrew/services"

brew "awscli"
brew "bash"
#brew "black", restart_service: :changed
brew "ffmpeg"
brew "findutils"
brew "flake8"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "grep"
brew "helm"
brew "httpie"
brew "jq"
brew "jupyterlab"
brew "libfido2"
brew "macos-trash" if OS.mac?
brew "mas" if OS.mac?
brew "media-info"
brew "mkvtoolnix"
brew "mp4v2"
# brew "mypy"
# brew "mysql-client"
# brew "node"
brew "openssh"
brew "opentofu"
# brew "pinentry"       # gpg related
# brew "pinentry-mac"   # gpg related
#brew "pipx"
#brew "pnpm"
#brew "postgresql@15", restart_service: :changed
#brew "pre-commit"
brew "prettier"
brew "python"
brew "r"
brew "rclone"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "taplo"
brew "terraform@1.5"
brew "terragrunt"
# brew "terraformer"
# brew "typescript"
# brew "wrangler"
brew "xquartz"
brew "ykman"
#brew "zsh"
#brew "zsh-completions"
#brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "brave-browser"
# cask "datagrip"
cask "docker"
cask "firefox"
cask "iina"
# cask "inkscape"
# cask "karabiner-elements"
cask "kitty"   # gpu-based terminal
# cask "notion"
cask "obs"
# cask "postico"
# cask "postman"
# cask "protonvpn"
# cask "rstudio"
cask "session-manager-plugin"
# cask "slack"
# cask "syncthing"
# cask "visual-studio-code"
cask "vlc"
# cask "vscodium"
# cask "zoom"
cask "zotero" # no arm64_big_sur yet

#mas "1password", id: 1333542190
#mas "bear", id: 1091189122
#mas "daisydisk", id: 411643860
#mas "duckduckgo privacy essentials", id: 1482920575
mas "keynote", id: 409183694
mas "numbers", id: 409203825
mas "pages", id: 409201541
#mas "pdf expert", id: 1055273043

# TODO:
# mas "imovie", id:
# mas "garageband", id:


# prior cask install list
# ==> Formulae
# adns
# ansible
# aom
# argocd
# aribb24
# arm-gcc-bin@8
# assimp
# assume-role
# autoconf
# automake
# avr-binutils
# avr-gcc@8
# avrdude
# aws-iam-authenticator
# aws-vault
# awscli
# awslogs
# awsume
# bash
# bash-completion
# bazaar
# bclm
# bdw-gc
# boost
# bootloadhid
# brotli
# c-ares
# c-kermit
# ca-certificates
# cairo
# capstone
# ccache
# cffi
# chamber
# cjson
# clang-format
# cli53
# cloudflared
# cmake
# cmocka
# confuse
# coreutils
# curl
# cvs
# dav1d
# dbus
# dcraw
# dep
# dfu-programmer
# dfu-util
# direnv
# docbook
# docbook-xsl
# docker-credential-helper-ecr
# docutils
# double-conversion
# dtc
# edencommon
# eksctl
# emacs
# exiftool
# fb303
# fbthrift
# fdk-aac
# ffmpeg
# figlet
# findutils
# fizz
# flac
# fmt
# folly
# fontconfig
# fpc
# freetype
# frei0r
# fribidi
# gawk
# gcc
# gd
# gdbm
# gdk-pixbuf
# gettext
# gflags
# ghostscript
# giflib
# gifsicle
# git
# git-delta
# git-sizer
# glew
# glib
# glog
# gmp
# gnu-getopt
# gnu-sed
# gnupg
# gnutls
# go
# godep
# gomplate
# gource
# graphite2
# graphviz
# grep
# gts
# guile
# gzip
# harfbuzz
# helm
# hidapi
# highway
# hiredis
# hunspell
# icu4c
# ievms
# ilmbase
# imagemagick
# imath
# inetutils
# isl
# ispell
# jansson
# jasper
# jbig2dec
# jemalloc
# jhead
# jpeg
# jpeg-turbo
# jpeg-xl
# jq
# jsonnet
# just
# k9s
# keyring
# kubent
# kubernetes-cli
# kubernetes-helm
# kustomize
# lame
# lastpass-cli
# leptonica
# levant
# libarchive
# libass
# libassuan
# libavif
# libb2
# libbluray
# libde265
# libelf
# libev
# libevent
# libffi
# libftdi
# libftdi0
# libgcrypt
# libgpg-error
# libheif
# libhid
# libice
# libidn
# libidn2
# libksba
# liblinear
# liblqr
# libmetalink
# libmng
# libmpc
# libnghttp2
# libogg
# libomp
# libpng
# libpthread-stubs
# libraw
# librist
# librsvg
# libsamplerate
# libslirp
# libsm
# libsndfile
# libsodium
# libsoxr
# libssh
# libssh2
# libsvg
# libsvg-cairo
# libtasn1
# libtiff
# libtool
# libunibreak
# libunistring
# libusb
# libusb-compat
# libuv
# libvidstab
# libvmaf
# libvorbis
# libvpx
# libx11
# libxau
# libxcb
# libxdmcp
# libxext
# libxft
# libxml2
# libxmu
# libxrender
# libxt
# libyaml
# linkerd
# little-cms2
# llvm
# lua
# lua@5.3
# lz4
# lzo
# m4
# make
# mbedtls
# md4c
# mdloader
# mercurial
# moreutils
# mpdecimal
# mpfr
# mpg123
# mtr
# ncurses
# neofetch
# netpbm
# nettle
# nghttp2
# ninja
# nmap
# node
# nomad
# npth
# nspr
# nss
# oniguruma
# opencore-amr
# openexr
# openjdk
# openjpeg
# openldap
# openssl@1.1
# openssl@3
# openvpn
# opus
# p11-kit
# p7zip
# packer
# pango
# pcre
# pcre2
# pidof
# pinentry
# pinentry-mac
# pipenv
# pixman
# pkcs11-helper
# pkg-config
# poppler
# pre-commit
# prettier
# protobuf
# protoc-gen-go
# pstree
# putty
# pycparser
# pyenv
# pyenv-virtualenv
# python-brotli
# python-certifi
# python-click
# python-cryptography
# python-lxml
# python-markupsafe
# python-mutagen
# python-packaging
# python-psutil
# python-pytz
# python-setuptools
# python-typing-extensions
# python@3.10
# python@3.11
# python@3.12
# pyyaml
# qemu
# qpdf
# rav1e
# rclone
# readline
# ripgrep
# rtmpdump
# rubberband
# ruby
# rust
# rustup-init
# rxvt-unicode
# scrcpy
# screen
# screenresolution
# sdl2
# sdl2_image
# shared-mime-info
# shellcheck
# shfmt
# shtool
# six
# snappy
# socat
# speex
# sqlite
# srt
# step
# streamlink
# svg2pdf
# svt-av1
# swig
# tag
# tcl-tk
# tcping
# telepresence
# terraforming
# terragrunt
# tesseract
# texi2html
# tfenv
# the_silver_searcher
# theora
# transmission-cli
# tree
# tree-sitter
# typescript
# ufraw
# unar
# unbound
# unrar
# vault
# vde
# virtualenv
# vncsnapshot
# wakatime-cli
# wangle
# watch
# watchman
# webp
# wget
# x264
# x265
# xidel
# xmlto
# xorgproto
# xvid
# xz
# yamllint
# yasm
# ykman
# yq
# yt-dlp
# z3
# zbar
# zeromq
# zimg
# zstd
# zxing-cpp
#
# => Casks
# 1password
# 1password-cli
# airy
# android-file-transfer
# android-platform-tools
# arduino
# arq
# audacity
# aws-vault
# balenaetcher
# barrier
# beardedspice
# betterdisplay
# bitwarden
# bria
# caffeine
# calibre
# cloudflare-warp
# coconutbattery
# cubicsdr
# daisydisk
# dexed
# drivedx
# firefox
# flux
# font-terminus
# gcc-arm-embedded
# gfxcardstatus
# gimp
# grandperspective
# gswitch
# handbrake
# hashicorp-vagrant
# jdiskreport
# jitsi
# keka
# keybase
# kindlegen
# krita
# lastpass
# linphone
# lulu
# macfuse
# multipass
# notunes
# obs
# ocenaudio
# osxfuse
# pacifist
# paintbrush
# pop
# radio-silence
# rember
# schism-tracker
# session-manager-plugin
# signal
# slack
# soundflowerbed
# steam
# subler
# teamviewer
# telegram-desktop
# tigervnc-viewer
# transmission
# tunnelblick
# vagrant
# vagrant-vmware-utility
# virtualbox
# virtualbox-extension-pack
# vlc
# vmware-fusion
# whatsapp
# xquartz
# yubico-authenticator
# yujitach-menumeters
# zoom
